tap "cloudflare/cloudflare"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "raine/workmux"
brew "abduco"
brew "xz"
brew "openssl@3"
brew "azure-cli"
brew "coreutils"
brew "exiftool"
brew "flyctl"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gh"
brew "git-lfs"
brew "gnu-sed"
brew "golangci-lint"
brew "grep"
brew "helm"
brew "himalaya"
brew "jfrog-cli"
brew "jq"
brew "kubernetes-cli"
brew "libusb"
brew "lnav"
brew "minikube"
brew "mosh"
brew "nvm"
brew "oath-toolkit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "redis"
brew "render"
brew "scrcpy"
brew "socat"
brew "terminal-notifier"
brew "tmux"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/yabai"
brew "raine/workmux/workmux"
cask "1password-cli"
cask "android-commandlinetools"
cask "gcloud-cli"
cask "hiddenbar"
cask "maccy"
cask "spaceid"
vscode "anysphere.cursorpyright"
vscode "anysphere.pyright"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "emilast.logfilehighlighter"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "mikoz.black-py"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-vscode.makefile-tools"
vscode "nomicfoundation.hardhat-solidity"
vscode "redhat.java"
vscode "rjmacarthy.twinny"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "ssmi.after-dark"
vscode "takumii.markdowntable"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "waderyan.gitblame"
go "github.com/go-delve/delve/cmd/dlv"
go "mvdan.cc/gofumpt"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/mgechev/revive"
go "honnef.co/go/tools/cmd/staticcheck"
