# Taps
tap "hashicorp/tap"
tap "koekeishiya/formulae"
tap "raine/workmux"

# Core CLI (better GNU versions)
brew "coreutils"
brew "gnu-sed"
brew "grep"
brew "gawk"

# Terminal & shell
brew "tmux"
brew "mosh"
brew "fzf"
brew "jq"

# Git
brew "gh"
brew "git-lfs"

# Node.js
brew "fnm"

# Python
brew "pyenv"
brew "pyenv-virtualenv"

# DevOps & Cloud
brew "hashicorp/tap/terraform"
brew "kubernetes-cli"
brew "helm"
brew "minikube"

# Workflow
brew "raine/workmux/workmux"
brew "koekeishiya/formulae/yabai"

# Utilities
brew "terminal-notifier"
brew "lnav"
brew "oath-toolkit"

# Apps
cask "1password-cli"
cask "hiddenbar"
cask "maccy"
